In [1]:
import pandas as pd
import numpy as np

In [3]:
fortune = pd.read_csv("fortune1000.csv", index_col = "Rank")
sectors = fortune.groupby("Sector")
fortune.head(3)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000

In [7]:
type(sectors)

pandas.core.groupby.DataFrameGroupBy

## The `.groupby()` Method

In [8]:
fortune = pd.read_csv("fortune1000.csv", index_col = "Rank")
sectors = fortune.groupby("Sector")
fortune.head(3)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000

## Retrieve A Group with the `.get_group()` Method

In [39]:
fortune = pd.read_csv("fortune1000.csv", index_col = "Rank")
sectors = fortune.groupby("Sector")
fortune.head(3)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000

## Methods on the Groupby Object and `DataFrame` Columns

In [51]:
fortune = pd.read_csv("fortune1000.csv", index_col = "Rank")
sectors = fortune.groupby("Sector")
fortune.head(3)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000

In [58]:
sectors.get_group("Apparel")["Profits"].sum()

8236

In [59]:
sectors.max()
sectors.min()
sectors.sum()
sectors.mean()

                                   Revenue      Profits     Employees
Sector
Aerospace & Defense           17897.000000  1437.100000  48402.850000
Apparel                        6397.866667   549.066667  23093.133333
Business Services              5337.156863   553.470588  26687.254902
Chemicals                      8129.900000   754.266667  15455.033333
Energy                        12441.057377  -602.024590   9745.303279
Engineering & Construction     5922.423077   204.000000  15642.615385
Financials                    15950.784173  1872.007194  24172.287770
Food and Drug Stores          32251.266667  1117.266667  93026.533333
Food, Beverages & Tobacco     12929.465116  1195.744186  28177.488372
Health Care                   21529.426667  1414.853333  35710.520000
Hotels, Resturants & Leisure   6781.840000   827.880000  99369.800000
Household Products             8383.464286   515.285714  23072.785714
Industrials                   10816.978261   451.391304  33591.934783
Materials                      6026.627907   102.976744  14840.069767
Media                          8830.560000   973.880000  22012.560000
Motor Vehicles & Parts        20105.833333  1079.083333  45106.666667
Retailing                     18313.450000   597.875000  77845.362500
Technology                    13505.882353  1769.343137  35087.735294
Telecommunications            30788.933333  3242.466667  55497.866667
Transportation                11347.444444  1226.916667  42688.694444
Wholesalers                   11120.000000   205.825000  13139.925000

In [67]:
sectors["Revenue"].sum()
sectors["Employees"].sum()
sectors["Profits"].max()
sectors["Profits"].min()
sectors["Employees"].mean()

sectors[["Revenue", "Profits"]].sum()

                              Revenue  Profits
Sector
Aerospace & Defense            357940    28742
Apparel                         95968     8236
Business Services              272195    28227
Chemicals                      243897    22628
Energy                        1517809   -73447
Engineering & Construction     153983     5304
Financials                    2217159   260209
Food and Drug Stores           483769    16759
Food, Beverages & Tobacco      555967    51417
Health Care                   1614707   106114
Hotels, Resturants & Leisure   169546    20697
Household Products             234737    14428
Industrials                    497581    20764
Materials                      259145     4428
Media                          220764    24347
Motor Vehicles & Parts         482540    25898
Retailing                     1465076    47830
Technology                    1377600   180473
Telecommunications             461834    48637
Transportation                 408508    44169
Wholesalers                    444800     8233

## Grouping by Multiple Columns

In [69]:
fortune = pd.read_csv("fortune1000.csv", index_col = "Rank")
sectors = fortune.groupby(["Sector", "Industry"])
fortune.head(3)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000

In [73]:
sectors.size()
sectors.sum()
sectors["Revenue"].sum()
sectors["Employees"].mean()

Sector                      Industry
Aerospace & Defense         Aerospace and Defense                              48402.850000
Apparel                     Apparel                                            23093.133333
Business Services           Advertising, marketing                             62050.000000
                            Diversified Outsourcing Services                   50595.000000
                            Education                                          15585.000000
                            Financial Data Services                            13943.473684
                            Miscellaneous                                      12573.333333
                            Temporary Help                                     12004.000000
                            Waste Management                                   23839.800000
Chemicals                   Chemicals                                          15455.033333
Energy                      Energy                                              5005.142857
                            Mining, Crude-Oil Production                        5325.357143
                            Miscellaneous                                       6700.000000
                            Oil and Gas Equipment, Services                    25088.333333
                            Petroleum Refining                                 14404.705882
                            Pipelines                                           6011.750000
                            Utilities: Gas and Electric                        10249.487805
Engineering & Construction  Engineering, Construction                          26293.142857
                            Homebuilders                                        3217.000000
Financials                  Commercial Banks                                   54965.142857
                            Diversified Financials                             21940.933333
                            Insurance: Life, Health (Mutual)                    5880.100000
                            Insurance: Life, Health (stock)                    11235.166667
                            Insurance: Property and Casualty (Mutual)          19021.142857
                            Insurance: Property and Casualty (Stock)           28361.535714
                            Real estate                                        10705.266667
                            Securities                                          7940.333333
Food and Drug Stores        Food and Drug Stores                               93026.533333
Food, Beverages & Tobacco   Beverages                                          22123.000000
                            Food Consumer Products                             33271.950000
                                                                                  ...
Materials                   Metals                                             13825.642857
                            Miscellaneous                                         52.000000
                            Packaging, Containers                              20840.375000
Media                       Entertainment                                      21309.111111
                            Publishing, Printing                               23821.428571
Motor Vehicles & Parts      Motor Vehicles and Parts                           45106.666667
Retailing                   Automotive Retailing, Services                     17497.400000
                            General Merchandisers                             340810.000000
                            Specialty Retailers: Apparel                       42807.944444
                            Specialty Retailers: Other                         44619.333333
Technology                  Computer Peripherals                               43814.750000
                            Computer Software                                  27771.142857
                            Computers, Office Equipment                        66869.285714
                            Information Technology Services                    75818.384615
                            Internet Services and Retailing                    28723.666667
                            Network and Other Communications Equipment         21379.285714
                            Scientific,Photographic and Control Equipment      19291.750000
                            Semiconductors and Other Electronic Components     26065.391304
Telecommunications          Telecommunications                                 55497.866667
Transportation              Airlines                                           43511.222222
                            Mail, Package, and Freight Delivery               332137.500000
                            Miscellaneous                                       4200.000000
                            Railroads                                          24368.800000
                            Transportation Equipment                           11945.200000
                            Transportation and Logistics                       24938.200000
                            Trucking, Truck Leasing                            18939.555556
Wholesalers                 Miscellaneous                                       9200.000000
                            Wholesalers: Diversified                            9353.240000
                            Wholesalers: Electronics and Office Equipment      20832.625000
                            Wholesalers: Food and Grocery                      19317.500000
Name: Employees, dtype: float64

## The `.agg()` Method

In [78]:
fortune = pd.read_csv("fortune1000.csv", index_col = "Rank")
sectors = fortune.groupby("Sector")
fortune.head(3)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000

In [80]:
sectors["Employees"].mean()

Sector
Aerospace & Defense             48402.850000
Apparel                         23093.133333
Business Services               26687.254902
Chemicals                       15455.033333
Energy                           9745.303279
Engineering & Construction      15642.615385
Financials                      24172.287770
Food and Drug Stores            93026.533333
Food, Beverages & Tobacco       28177.488372
Health Care                     35710.520000
Hotels, Resturants & Leisure    99369.800000
Household Products              23072.785714
Industrials                     33591.934783
Materials                       14840.069767
Media                           22012.560000
Motor Vehicles & Parts          45106.666667
Retailing                       77845.362500
Technology                      35087.735294
Telecommunications              55497.866667
Transportation                  42688.694444
Wholesalers                     13139.925000
Name: Employees, dtype: float64

In [83]:
sectors.agg({"Revenue" : ["sum", "mean"],
             "Profits" : "sum",
              "Employees" : "mean"})

                              Revenue               Profits     Employees
                                  sum          mean     sum          mean
Sector
Aerospace & Defense            357940  17897.000000   28742  48402.850000
Apparel                         95968   6397.866667    8236  23093.133333
Business Services              272195   5337.156863   28227  26687.254902
Chemicals                      243897   8129.900000   22628  15455.033333
Energy                        1517809  12441.057377  -73447   9745.303279
Engineering & Construction     153983   5922.423077    5304  15642.615385
Financials                    2217159  15950.784173  260209  24172.287770
Food and Drug Stores           483769  32251.266667   16759  93026.533333
Food, Beverages & Tobacco      555967  12929.465116   51417  28177.488372
Health Care                   1614707  21529.426667  106114  35710.520000
Hotels, Resturants & Leisure   169546   6781.840000   20697  99369.800000
Household Products             234737   8383.464286   14428  23072.785714
Industrials                    497581  10816.978261   20764  33591.934783
Materials                      259145   6026.627907    4428  14840.069767
Media                          220764   8830.560000   24347  22012.560000
Motor Vehicles & Parts         482540  20105.833333   25898  45106.666667
Retailing                     1465076  18313.450000   47830  77845.362500
Technology                    1377600  13505.882353  180473  35087.735294
Telecommunications             461834  30788.933333   48637  55497.866667
Transportation                 408508  11347.444444   44169  42688.694444
Wholesalers                    444800  11120.000000    8233  13139.925000

In [82]:
sectors.agg(["size", "sum", "mean"])

                             Revenue                        Profits          \
                                size      sum          mean    size     sum
Sector
Aerospace & Defense               20   357940  17897.000000      20   28742
Apparel                           15    95968   6397.866667      15    8236
Business Services                 51   272195   5337.156863      51   28227
Chemicals                         30   243897   8129.900000      30   22628
Energy                           122  1517809  12441.057377     122  -73447
Engineering & Construction        26   153983   5922.423077      26    5304
Financials                       139  2217159  15950.784173     139  260209
Food and Drug Stores              15   483769  32251.266667      15   16759
Food, Beverages & Tobacco         43   555967  12929.465116      43   51417
Health Care                       75  1614707  21529.426667      75  106114
Hotels, Resturants & Leisure      25   169546   6781.840000      25   20697
Household Products                28   234737   8383.464286      28   14428
Industrials                       46   497581  10816.978261      46   20764
Materials                         43   259145   6026.627907      43    4428
Media                             25   220764   8830.560000      25   24347
Motor Vehicles & Parts            24   482540  20105.833333      24   25898
Retailing                         80  1465076  18313.450000      80   47830
Technology                       102  1377600  13505.882353     102  180473
Telecommunications                15   461834  30788.933333      15   48637
Transportation                    36   408508  11347.444444      36   44169
Wholesalers                       40   444800  11120.000000      40    8233

                                          Employees
                                     mean      size      sum          mean
Sector
Aerospace & Defense           1437.100000        20   968057  48402.850000
Apparel                        549.066667        15   346397  23093.133333
Business Services              553.470588        51  1361050  26687.254902
Chemicals                      754.266667        30   463651  15455.033333
Energy                        -602.024590       122  1188927   9745.303279
Engineering & Construction     204.000000        26   406708  15642.615385
Financials                    1872.007194       139  3359948  24172.287770
Food and Drug Stores          1117.266667        15  1395398  93026.533333
Food, Beverages & Tobacco     1195.744186        43  1211632  28177.488372
Health Care                   1414.853333        75  2678289  35710.520000
Hotels, Resturants & Leisure   827.880000        25  2484245  99369.800000
Household Products             515.285714        28   646038  23072.785714
Industrials                    451.391304        46  1545229  33591.934783
Materials                      102.976744        43   638123  14840.069767
Media                          973.880000        25   550314  22012.560000
Motor Vehicles & Parts        1079.083333        24  1082560  45106.666667
Retailing                      597.875000        80  6227629  77845.362500
Technology                    1769.343137       102  3578949  35087.735294
Telecommunications            3242.466667        15   832468  55497.866667
Transportation                1226.916667        36  1536793  42688.694444
Wholesalers                    205.825000        40   525597  13139.925000

# Custom function to groupby()

In [3]:
df = pd.DataFrame( { 'company': [ 'Alpha', 'Alpha', 'Alpha',
                                  'Beta', 'Beta', 'Beta',
                                  'Gamma', 'Gamma', 'Gamma'],
                     'region':  [ 'NE', 'NW', 'SW', 'NW', 'SW',
                                  'NE', 'NE', 'SW', 'NW'],
                     'revenue': [ 10, 9, 2, 15, 8, 2, 16, 3, 9],
                     'revtype': [ 'retail', 'retail', 'wholesale',
                                  'wholesale', 'wholesale', 'retail',
                                  'wholesale', 'retail', 'retail'     ] } )

def get_sum(df_slice):
    return sum(df_slice['revenue'])

print(df.groupby('region').apply(get_sum))  # custom function: same as groupby('region').sum()

region
NE    28
NW    33
SW    13
dtype: int64

In [4]:
# Also you can pass function that will aggregate groups in goupby()
# NOTE: By default groupby() takes index of row as an argument

def bydecplace(idx):
    row = df.loc[idx]                 # a Series with the row values for this index
    return(len(str(row['revenue'])))  # '2' if 10; '1' if 9

print(df.groupby(bydecplace).sum())   # in groupby() it iteratively runs bydecplace() for eanh row, than rows are grouped
                                      # by particular values which were retrieved after call of bydecplace().
                                      # as groupby() took bydecplace() as argument, index was passed to bydecplace().

   revenue
1       33
2       41

## Iterating through Groups

In [4]:
fortune = pd.read_csv("fortune1000.csv", index_col = "Rank")
sectors = fortune.groupby("Sector")
fortune.head(3)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000

In [5]:
sectors

In [6]:
df = pd.DataFrame(columns = fortune.columns)
df

Empty DataFrame
Columns: [Company, Sector, Industry, Location, Revenue, Profits, Employees]
Index: []

In [7]:
for sector, data in sectors:
    highest_revenue_company_in_group = data.nlargest(1, "Revenue")
    df = df.append(highest_revenue_company_in_group)

In [8]:
i = 0
for sector, data in sectors:
    if i == 1:
        break
    else:
        print(sector)
        print(data[:][0:4])
        i += 1

Aerospace & Defense
                  Company               Sector               Industry  \
Rank
24                 Boeing  Aerospace & Defense  Aerospace and Defense
45    United Technologies  Aerospace & Defense  Aerospace and Defense
60        Lockheed Martin  Aerospace & Defense  Aerospace and Defense
88       General Dynamics  Aerospace & Defense  Aerospace and Defense

              Location  Revenue  Profits  Employees
Rank
24         Chicago, IL    96114     5176     161400
45      Farmington, CT    61047     7608     197200
60        Bethesda, MD    46132     3605     126000
88    Falls Church, VA    31469     2965      99900

In [9]:
df

,Company,Sector,Industry,Location,Revenue,Profits,Employees
24,Boeing,Aerospace & Defense,Aerospace and Defense,"Chicago, IL",96114,5176,161400
91,Nike,Apparel,Apparel,"Beaverton, OR",30601,3273,62600
144,ManpowerGroup,Business Services,Temporary Help,"Milwaukee, WI",19330,419,27000
56,Dow Chemical,Chemicals,Chemicals,"Midland, MI",48778,7685,49495
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
155,Fluor,Engineering & Construction,"Engineering, Construction","Irving, TX",18114,413,38758
4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
7,CVS Health,Food and Drug Stores,Food and Drug Stores,"Woonsocket, RI",153290,5237,199000
41,Archer Daniels Midland,"Food, Beverages & Tobacco",Food Production,"Chicago, IL",67702,1849,32300
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
109,McDonalds,"Hotels, Resturants & Leisure",Food Services,"Oak Brook, IL",25413,4529,420000
34,Procter & Gamble,Household Products,Household and Personal Products,"Cincinnati, OH",78756,7036,110000
11,General Electric,Industrials,Industrial Machinery,"Fairfield, CT",140389,-6126,333000
126,Alcoa,Materials,Metals,"New York, NY",22534,-322,60000
53,Disney,Media,Entertainment,"Burbank, CA",52465,8382,185000
8,General Motors,Motor Vehicles & Parts,Motor Vehicles and Parts,"Detroit, MI",152356,9687,215000
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
10,AT&T,Telecommunications,Telecommunications,"Dallas, TX",146801,13345,281450
48,UPS,Transportation,"Mail, Package, and Freight Delivery","Atlanta, GA",58363,4844,341240
57,Sysco,Wholesalers,Wholesalers: Food and Grocery,"Houston, TX",48681,687,51700

In [10]:
cities = fortune.groupby("Location")
df = pd.DataFrame(columns = fortune.columns)
df

Empty DataFrame
Columns: [Company, Sector, Industry, Location, Revenue, Profits, Employees]
Index: []

In [11]:
for city, data in cities:
    highest_revenue_in_city = data.nlargest(1, "Revenue")
    df = df.append(highest_revenue_in_city)

In [15]:
df.groupby('Company').filter(lambda x: sum(x['Revenue']) > 100000)

,Company,Sector,Industry,Location,Revenue,Profits,Employees
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
12,AmerisourceBergen,Health Care,Wholesalers: Health Care,"Chesterbrook, PA",135962,-135,17000
17,Kroger,Food and Drug Stores,Food and Drug Stores,"Cincinnati, OH",109830,2039,431000
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
10,AT&T,Telecommunications,Telecommunications,"Dallas, TX",146801,13345,281450
9,Ford Motor,Motor Vehicles & Parts,Motor Vehicles and Parts,"Dearborn, MI",149558,7373,199000
19,Walgreens Boots Alliance,Food and Drug Stores,Food and Drug Stores,"Deerfield, IL",103444,4220,302500
8,General Motors,Motor Vehicles & Parts,Motor Vehicles and Parts,"Detroit, MI",152356,9687,215000
21,Cardinal Health,Health Care,Wholesalers: Health Care,"Dublin, OH",102531,1215,34500
11,General Electric,Industrials,Industrial Machinery,"Fairfield, CT",140389,-6126,333000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
15,Costco,Retailing,Specialty Retailers: Other,"Issaquah, WA",116199,2377,161000
6,UnitedHealth Group,Health Care,Health Care: Insurance and Managed Care,"Minnetonka, MN",157107,5813,200000
13,Verizon,Telecommunications,Telecommunications,"New York, NY",131620,17879,177700
4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
20,HP,Technology,"Computers, Office Equipment","Palo Alto, CA",103355,4554,287000
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
14,Chevron,Energy,Petroleum Refining,"San Ramon, CA",131118,4587,61500
18,Amazon.com,Technology,Internet Services and Retailing,"Seattle, WA",107006,596,230800
22,Express Scripts Holding,Health Care,Health Care: Pharmacy and Other Services,"St. Louis, MO",101752,2476,25900
16,Fannie Mae,Financials,Diversified Financials,"Washington, DC",110359,10954,7300
7,CVS Health,Food and Drug Stores,Food and Drug Stores,"Woonsocket, RI",153290,5237,199000

In [48]:
test_df = pd.DataFrame(
    {
        'A': ['1','1','1','2','2','2'],
        'B': [1,2,3,10,20,30]
    }
)
test_df

   A   B
0  1   1
1  1   2
2  1   3
3  2  10
4  2  20
5  2  30

In [66]:
test_df.assign(
    mean = lambda x: np.mean(x['B']),
    mean2 = lambda x: x['mean'] + 1,
    minmax = lambda x: x.apply(lambda y: (x.loc[(x['B'] > y['B']) & (x['A'] == y['A']), 'B']).min(), axis = 1)
)

   A   B  mean  mean2  minmax
0  1   1  11.0   12.0     2.0
1  1   2  11.0   12.0     3.0
2  1   3  11.0   12.0     NaN
3  2  10  11.0   12.0    20.0
4  2  20  11.0   12.0    30.0
5  2  30  11.0   12.0     NaN

In [60]:
test_df2 = pd.DataFrame(
    {
        'A': ['1','1','1','1','1','1','2','2','2','2','2','2'],
        'period': [1,2,3,4,5,6,2,3,4,5,6,7],
        'status': [1,0,0,1,1,0,1,1,1,0,0,1]
    }
)
test_df2

    A  period  status
0   1       1       1
1   1       2       0
2   1       3       0
3   1       4       1
4   1       5       1
5   1       6       0
6   2       2       1
7   2       3       1
8   2       4       1
9   2       5       0
10  2       6       0
11  2       7       1

In [85]:
test_df2.assign(
    rank = lambda x: x.groupby('A')['period'].rank(method = 'dense'),
    min_bound = lambda x: x.apply(
        lambda y: (
            x.loc[
                (x['A'] == y['A']) 
                & 
                (x['rank'] <= y['rank']) 
                & 
                (x['status'] == 1), 
                'rank'
            ]
        ).max() + 1 if y['status'] == 0 else np.nan, 
        axis = 1
    ),
    max_bound = lambda x: x.apply(
        lambda y: (
            x.loc[
                (x['A'] == y['A']) 
                & 
                (x['rank'] >= y['rank']) 
                & 
                (x['status'] == 1), 
                'rank'
            ]
        ).min() if y['status'] == 0 else np.nan, 
        axis = 1
    ),
    min_date = lambda x: x.apply(
        lambda y: (
            (x.loc[(x['rank'] == y['min_bound']) & (x['A'] == y['A']), 'period']).min()
        ),
        axis = 1
    ),
    max_date = lambda x: x.apply(
        lambda y: (
            (x.loc[(x['rank'] == y['max_bound']) & (x['A'] == y['A']), 'period']).min()
        ),
        axis = 1
    )
)

    A  period  status  rank  min_bound  max_bound  min_date  max_date
0   1       1       1   1.0        NaN        NaN       NaN       NaN
1   1       2       0   2.0        2.0        4.0       2.0       4.0
2   1       3       0   3.0        2.0        4.0       2.0       4.0
3   1       4       1   4.0        NaN        NaN       NaN       NaN
4   1       5       1   5.0        NaN        NaN       NaN       NaN
5   1       6       0   6.0        6.0        NaN       6.0       NaN
6   2       2       1   1.0        NaN        NaN       NaN       NaN
7   2       3       1   2.0        NaN        NaN       NaN       NaN
8   2       4       1   3.0        NaN        NaN       NaN       NaN
9   2       5       0   4.0        4.0        6.0       5.0       7.0
10  2       6       0   5.0        4.0        6.0       5.0       7.0
11  2       7       1   6.0        NaN        NaN       NaN       NaN

# Transform() and apply() approach to count minmax

In [2]:
test_df = pd.DataFrame(
    {
        'A': [1, 1, 1, 2, 2, 2],
        'B': [1, 2, 3, 10, 20, 30],
        'C': [1, 2, 3, 10, 20, 30]
    }
)

test_df.assign(
    min_max = 
        lambda df: df.groupby('A')['B'].transform(lambda x: x.apply(lambda y: (x[x > y]).min()))
)

   A   B   C  min_max
0  1   1   1      2.0
1  1   2   2      3.0
2  1   3   3      NaN
3  2  10  10     20.0
4  2  20  20     30.0
5  2  30  30      NaN

In [3]:
# Here you see that For column C for value 200 next minmax should be 300, but it is 100, as in expression
# x.loc[x.B > y.B].min(), we pass [True, False] list which is applied ti column B, and for be the first row index is
# x.B = 2, which os x.C = 100
test_df.groupby('A').apply(lambda x: x.apply(lambda y: x.loc[x.B > y.B].min(), axis=1))

     A     B     C
0  1.0   2.0   2.0
1  1.0   3.0   3.0
2  NaN   NaN   NaN
3  2.0  20.0  20.0
4  2.0  30.0  30.0
5  NaN   NaN   NaN

In [23]:
# Here we don't reference to B as x.B or y.B, as we pass Series object after groupby('A')['B']
test_df.assign(
    min_max = 
        lambda df: df.groupby('A')['B'].apply(lambda x: x.apply(lambda y: x.loc[x > y].min()))
)
# Here we must take 'B' in [] if we want to select column 'B': x.loc[x['B'] > y['B'], ['B']], because taking column in[]
# returns Series output, instead of numpy.int scalrar, hence we will be able to assign new column as old indexies would
# be preserved
test_df.assign(
    min_max = 
        lambda df: df.groupby('A').apply(lambda x: x.apply(lambda y: x.loc[x['B'] > y['B'], ['B']].min(), axis = 1))
)

   A   B   C  min_max
0  1   1   1      2.0
1  1   2   2      3.0
2  1   3   3      NaN
3  2  10  10     20.0
4  2  20  20     30.0
5  2  30  30      NaN